{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Llama-index Examples\n",
    "\n",
    "- [ドキュメント](https://docs.llamaindex.ai/en/stable/examples/query_engine/knowledge_graph_query_engine/?h=knowl)の内容を実行する\n",
    "- [Nebula Graph](https://www.nebula-graph.io/)の使い方を調べる\n",
    "    - こちらの[ドキュメント](https://docs.nebula-graph.io/3.6.0/2.quick-start/1.quick-start-workflow/)に従って `Docker Compose` を活用して実行\n",
    "        - `docker exec -it nebula-docker-compose-console-1 /bin/bash` のNebula Consoleの操作方法\n",
    "        - `/ # ./usr/local/bin/nebula-console -u root -p root --address=graphd --port=9669` の接続\n",
    "    - Nebula Graphのコマンドはこちらの[ドキュメント](https://docs.nebula-graph.io/3.8.0/3.ngql-guide/9.space-statements/1.create-space/)を参照\n",
    "    \n",
    "    - llamaindexのスペースの作成手順\n",
    "\n",
    "        ```bash\n",
    "        ❯ docker exec -it nebula-docker-compose-console-1 /bin/sh\n",
    "        / # ./usr/local/bin/nebula-console -u root -p root --address=graphd --port=9669\n",
    "                                                                                                                                                                                                    Welcome!\n",
    "\n",
    "        (root@nebula) [(none)]> CREATE SPACE llamaindex(vid_type=FIXED_STRING(256), partition_num=1, replica_factor=1)\n",
    "        Execution succeeded (time spent 17.518ms/18.580547ms)\n",
    "\n",
    "        Fri, 12 Jul 2024 07:31:35 UTC\n",
    "\n",
    "        (root@nebula) [(none)]> :sleep 10\n",
    "        (root@nebula) [(none)]> USE llamaindex\n",
    "        Execution succeeded (time spent 1.444ms/2.040943ms)\n",
    "\n",
    "        Fri, 12 Jul 2024 07:31:56 UTC\n",
    "\n",
    "        (root@nebula) [llamaindex]> CREATE TAG entity(name string)\n",
    "        Execution succeeded (time spent 14.981ms/15.586641ms)\n",
    "\n",
    "        Fri, 12 Jul 2024 07:32:04 UTC\n",
    "\n",
    "        (root@nebula) [llamaindex]> CREATE EDGE relationship(relationship string)\n",
    "        Execution succeeded (time spent 2.699ms/3.224067ms)\n",
    "\n",
    "        Fri, 12 Jul 2024 07:32:10 UTC\n",
    "\n",
    "        (root@nebula) [llamaindex]> :sleep 10\n",
    "        (root@nebula) [llamaindex]> CREATE TAG INDEX entity_index ON entity(name(256))\n",
    "        Execution succeeded (time spent 3.516ms/4.170609ms)\n",
    "\n",
    "        Fri, 12 Jul 2024 07:32:28 UTC\n",
    "\n",
    "        (root@nebula) [llamaindex]>    \n",
    "        ```\n",
    "- [Youtube](https://www.youtube.com/playlist?list=PL4ArMmsAnb84uB2d9L46eXpIi7Epz2cfp)\n",
    "    - Hostの確認 => SHOW HOSTS\n",
    "    \n",
    "        ```bash\n",
    "        (root@nebula) [(none)]> SHOW HOSTS\n",
    "        +-------------+------+----------+--------------+-------------------------------+-------------------------------+---------+\n",
    "        | Host        | Port | Status   | Leader count | Leader distribution           | Partition distribution        | Version |\n",
    "        +-------------+------+----------+--------------+-------------------------------+-------------------------------+---------+\n",
    "        | \"storaged0\" | 9779 | \"ONLINE\" | 0            | \"No valid partition\"          | \"No valid partition\"          | \"3.6.0\" |\n",
    "        | \"storaged1\" | 9779 | \"ONLINE\" | 0            | \"No valid partition\"          | \"No valid partition\"          | \"3.6.0\" |\n",
    "        | \"storaged2\" | 9779 | \"ONLINE\" | 2            | \"boxerengine:1, llamaindex:1\" | \"boxerengine:1, llamaindex:1\" | \"3.6.0\" |\n",
    "        +-------------+------+----------+--------------+-------------------------------+-------------------------------+---------+\n",
    "        Got 3 rows (time spent 1.498ms/3.166489ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:13:59 UTC\n",
    "        ```\n",
    "    - Spaceの作成 => CREATE SPACE\n",
    "    - Spaceの内容を確認する => DESCRIBE SPACE\n",
    "    \n",
    "        ```bash\n",
    "        # バージョンの問題で引数の設定が必要になっている\n",
    "        # vid_typeの指定が必要\n",
    "        (root@nebula) [(none)]> CREATE SPACE defaultvalue;\n",
    "        [ERROR (-1009)]: SemanticError: space vid_type must be specified explicitly\n",
    "\n",
    "        Tue, 16 Jul 2024 08:17:25 UTC\n",
    "\n",
    "        # 以下のコマンドで作成\n",
    "        (root@nebula) [(none)]> CREATE SPACE defaultvalue(vid_type=FIXED_STRING(256), partition_num=1, replica_factor=1)\n",
    "        Execution succeeded (time spent 14.061ms/14.647479ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:18:33 UTC\n",
    "\n",
    "        (root@nebula) [(none)]> DESCRIBE SPACE defaultvalue;\n",
    "        +----+----------------+------------------+----------------+---------+------------+---------------------+---------+\n",
    "        | ID | Name           | Partition Number | Replica Factor | Charset | Collate    | Vid Type            | Comment |\n",
    "        +----+----------------+------------------+----------------+---------+------------+---------------------+---------+\n",
    "        | 3  | \"defaultvalue\" | 1                | 1              | \"utf8\"  | \"utf8_bin\" | \"FIXED_STRING(256)\" |         |\n",
    "        +----+----------------+------------------+----------------+---------+------------+---------------------+---------+\n",
    "        Got 1 rows (time spent 1.076ms/1.78386ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:18:48 UTC\n",
    "        ```\n",
    "        \n",
    "    - Spaceの一覧を確認 => SHOW SPACES\n",
    "    \n",
    "        ```bash\n",
    "        (root@nebula) [(none)]> SHOW SPACES;\n",
    "        +----------------+\n",
    "        | Name           |\n",
    "        +----------------+\n",
    "        | \"boxerengine\"  |\n",
    "        | \"defaultvalue\" |\n",
    "        | \"llamaindex\"   |\n",
    "        +----------------+\n",
    "        Got 3 rows (time spent 1.273ms/2.231885ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:25:58 UTC\n",
    "        ```\n",
    "    \n",
    "    - Spaceの削除 => DROP SPACES:\n",
    "        \n",
    "        ```bash\n",
    "        (root@nebula) [(none)]> DROP SPACE defaultvalue;\n",
    "        Execution succeeded (time spent 2.834ms/3.450981ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:28:26 UTC\n",
    "\n",
    "        # defaultvalueのスペースが消えていることを確認\n",
    "        (root@nebula) [(none)]> SHOW SPACES;\n",
    "        +---------------+\n",
    "        | Name          |\n",
    "        +---------------+\n",
    "        | \"boxerengine\" |\n",
    "        | \"llamaindex\"  |\n",
    "        +---------------+\n",
    "        Got 2 rows (time spent 742µs/1.300884ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:28:32 UTC\n",
    "        ```\n",
    "                \n",
    "    - Spaceを使用する => USE;\n",
    "    \n",
    "        ```bash\n",
    "        (root@nebula) [(none)]> CREATE SPACE nba(vid_type=FIXED_STRING(256), partition_num=10, replica_factor=3);\n",
    "        Execution succeeded (time spent 2.671ms/3.326334ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:31:00 UTC\n",
    "\n",
    "        (root@nebula) [(none)]> SHOW SPACES;\n",
    "        +---------------+\n",
    "        | Name          |\n",
    "        +---------------+\n",
    "        | \"boxerengine\" |\n",
    "        | \"llamaindex\"  |\n",
    "        | \"nba\"         |\n",
    "        +---------------+\n",
    "        Got 3 rows (time spent 1.031ms/1.653703ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:31:25 UTC\n",
    "\n",
    "        # nbaを使用する\n",
    "        (root@nebula) [(none)]> USE nba\n",
    "        Execution succeeded (time spent 498µs/777.047µs)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:31:29 UTC\n",
    "        ```\n",
    "    \n",
    "     - Tagを作成する => CREATE TAG;\n",
    "     - Tagを表示する => SHOW TAGS;\n",
    "     - Tagの定義を確認する => DESCRIBE TAG\n",
    "     \n",
    "        ```bash\n",
    "        # player tagを作成\n",
    "        (root@nebula) [nba]> CREATE TAG player(name string, age int);\n",
    "        Execution succeeded (time spent 2.791ms/3.598903ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:37:52 UTC\n",
    "\n",
    "        # TAGの一覧を確認\n",
    "        (root@nebula) [nba]> SHOW TAGS;\n",
    "        +----------+\n",
    "        | Name     |\n",
    "        +----------+\n",
    "        | \"player\" |\n",
    "        +----------+\n",
    "        Got 1 rows (time spent 738µs/1.230908ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:37:57 UTC\n",
    "\n",
    "        # team tagを作成\n",
    "        (root@nebula) [nba]> CREATE TAG team(name string);\n",
    "        Execution succeeded (time spent 1.505ms/1.926175ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:38:26 UTC\n",
    "\n",
    "        # TAGの一覧を確認\n",
    "        (root@nebula) [nba]> SHOW TAGS\n",
    "        +----------+\n",
    "        | Name     |\n",
    "        +----------+\n",
    "        | \"player\" |\n",
    "        | \"team\"   |\n",
    "        +----------+\n",
    "        Got 2 rows (time spent 1.231ms/2.058886ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:38:30 UTC\n",
    "        \n",
    "        # player tagの定義を確認する\n",
    "        (root@nebula) [nba]> DESCRIBE TAG player;\n",
    "        +--------+----------+-------+---------+---------+\n",
    "        | Field  | Type     | Null  | Default | Comment |\n",
    "        +--------+----------+-------+---------+---------+\n",
    "        | \"name\" | \"string\" | \"YES\" |         |         |\n",
    "        | \"age\"  | \"int64\"  | \"YES\" |         |         |\n",
    "        +--------+----------+-------+---------+---------+\n",
    "        Got 2 rows (time spent 3.904ms/4.664581ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:41:08 UTC\n",
    "\n",
    "        # team tagの定義を確認する\n",
    "        (root@nebula) [nba]> DESCRIBE TAG team;\n",
    "        +--------+----------+-------+---------+---------+\n",
    "        | Field  | Type     | Null  | Default | Comment |\n",
    "        +--------+----------+-------+---------+---------+\n",
    "        | \"name\" | \"string\" | \"YES\" |         |         |\n",
    "        +--------+----------+-------+---------+---------+\n",
    "        Got 1 rows (time spent 1.379ms/2.267737ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:41:14 UTC\n",
    "        ```\n",
    "\n",
    "    - TAGの削除 => DROP TAG;\n",
    "\n",
    "        ```bash\n",
    "        # property_free tagを作成\n",
    "        (root@nebula) [nba]> CREATE TAG property_free();\n",
    "        Execution succeeded (time spent 2.717ms/3.571051ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:52:25 UTC\n",
    "\n",
    "        # property_free tagが作成されていることを確認\n",
    "        (root@nebula) [nba]> SHOW TAGS;\n",
    "        +-----------------+\n",
    "        | Name            |\n",
    "        +-----------------+\n",
    "        | \"player\"        |\n",
    "        | \"property_free\" |\n",
    "        | \"team\"          |\n",
    "        +-----------------+\n",
    "        Got 3 rows (time spent 1.106ms/1.78381ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:52:31 UTC\n",
    "\n",
    "        # property_free tagを削除\n",
    "        (root@nebula) [nba]> DROP TAG property_free\n",
    "        Execution succeeded (time spent 2.496ms/3.116757ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:52:49 UTC\n",
    "\n",
    "        # property_free tagが削除されていることを確認\n",
    "        (root@nebula) [nba]> SHOW TAGS\n",
    "        +----------+\n",
    "        | Name     |\n",
    "        +----------+\n",
    "        | \"player\" |\n",
    "        | \"team\"   |\n",
    "        +----------+\n",
    "        Got 2 rows (time spent 1.145ms/1.797843ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:52:53 UTC\n",
    "        ```\n",
    "    \n",
    "    - EDGEの作成 => CREATE EDGE;\n",
    "    - EDGEの一覧を確認 => SHOW EDGES;\n",
    "    - EDGEの内容を確認 => DESCRIBE EDGE;\n",
    "    - EDGEの削除 => DROP EDGE;\n",
    "    \n",
    "        ```bash\n",
    "        # follow edgeの作成\n",
    "        (root@nebula) [nba]> CREATE EDGE follow(degreee int);\n",
    "        Execution succeeded (time spent 2.921ms/3.441899ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:56:55 UTC\n",
    "\n",
    "        # follow edgeが作成されたことを確認\n",
    "        (root@nebula) [nba]> SHOW EDGES;\n",
    "        +----------+\n",
    "        | Name     |\n",
    "        +----------+\n",
    "        | \"follow\" |\n",
    "        +----------+\n",
    "        Got 1 rows (time spent 1.008ms/1.405089ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:57:13 UTC\n",
    "\n",
    "        # serve edgeの作成\n",
    "        (root@nebula) [nba]> CREATE EDGE serve(start_year int, end_year int);\n",
    "        Execution succeeded (time spent 1.63ms/2.011109ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:57:37 UTC\n",
    "\n",
    "        # serve edgeが作成されたことを確認\n",
    "        (root@nebula) [nba]> SHOW EDGES;\n",
    "        +----------+\n",
    "        | Name     |\n",
    "        +----------+\n",
    "        | \"follow\" |\n",
    "        | \"serve\"  |\n",
    "        +----------+\n",
    "        Got 2 rows (time spent 722µs/1.164285ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:57:42 UTC\n",
    "\n",
    "        # serve edgeの内容を確認\n",
    "        (root@nebula) [nba]> DESCRIBE EDGE serve;\n",
    "        +--------------+---------+-------+---------+---------+\n",
    "        | Field        | Type    | Null  | Default | Comment |\n",
    "        +--------------+---------+-------+---------+---------+\n",
    "        | \"start_year\" | \"int64\" | \"YES\" |         |         |\n",
    "        | \"end_year\"   | \"int64\" | \"YES\" |         |         |\n",
    "        +--------------+---------+-------+---------+---------+\n",
    "        Got 2 rows (time spent 1.215ms/1.711768ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:57:55 UTC\n",
    "\n",
    "        # follow edgeの内容を確認\n",
    "        (root@nebula) [nba]> DESCRIBE EDGE follow;\n",
    "        +-----------+---------+-------+---------+---------+\n",
    "        | Field     | Type    | Null  | Default | Comment |\n",
    "        +-----------+---------+-------+---------+---------+\n",
    "        | \"degreee\" | \"int64\" | \"YES\" |         |         |\n",
    "        +-----------+---------+-------+---------+---------+\n",
    "        Got 1 rows (time spent 997µs/1.57029ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:58:17 UTC\n",
    "\n",
    "        # no_property edgeを作成\n",
    "        (root@nebula) [nba]> CREATE EDGE no_property();\n",
    "        Execution succeeded (time spent 2.668ms/3.239231ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:58:30 UTC\n",
    "\n",
    "        # no_property edgeが作成されたことを確認\n",
    "        (root@nebula) [nba]> SHOW EDGES\n",
    "        +---------------+\n",
    "        | Name          |\n",
    "        +---------------+\n",
    "        | \"follow\"      |\n",
    "        | \"no_property\" |\n",
    "        | \"serve\"       |\n",
    "        +---------------+\n",
    "        Got 3 rows (time spent 1.095ms/1.785805ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:58:37 UTC\n",
    "\n",
    "        # no_property edgeを削除\n",
    "        (root@nebula) [nba]> DROP EDGE no_property\n",
    "        Execution succeeded (time spent 2ms/2.424958ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:58:54 UTC\n",
    "\n",
    "        # no_property edgeが削除されたことを確認\n",
    "        (root@nebula) [nba]> SHOW TAGS;\n",
    "        +----------+\n",
    "        | Name     |\n",
    "        +----------+\n",
    "        | \"player\" |\n",
    "        | \"team\"   |\n",
    "        +----------+\n",
    "        Got 2 rows (time spent 969µs/1.4589ms)\n",
    "\n",
    "        Tue, 16 Jul 2024 08:59:00 UTC\n",
    "        ```\n",
    "    \n",
    "    - Vertexの追加 =>  INSERT VERTEX;\n",
    "    - Vertexの確認 =>  FETCH PROP ON;\n",
    "    - Vertexの削除 =>  DELETE VERTEX;\n",
    "    \n",
    "        ```bash\n",
    "        # player Tim Duncanを登録\n",
    "        (root@nebula) [nba]> INSERT VERTEX player(name, age) VALUES \"100\":(\"Tim Duncan\", 42);\n",
    "        Execution succeeded (time spent 8.255ms/8.759457ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 02:49:25 UTC\n",
    "\n",
    "        # player Tim Duncanが登録されていることを確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON player \"100\" YIELD properties(vertex);\n",
    "        +-------------------------------+\n",
    "        | properties(VERTEX)            |\n",
    "        +-------------------------------+\n",
    "        | {age: 42, name: \"Tim Duncan\"} |\n",
    "        +-------------------------------+\n",
    "        Got 1 rows (time spent 4.783ms/5.276236ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 02:50:44 UTC\n",
    "        \n",
    "        # playerを一回のコマンドで複数人登録\n",
    "        (root@nebula) [nba]> INSERT VERTEX player(name, age) VALUES \"101\":(\"Tony Parker\", 36), \"102\":(\"LaMarcus Aldridge\", 33), \"103\":(\"Rudy Gay\", 32), \"99\":(\"Useless\", 0);\n",
    "        Execution succeeded (time spent 2.01ms/2.561377ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 02:54:13 UTC\n",
    "\n",
    "        # teamを一回のコマンドで複数人登録\n",
    "        (root@nebula) [nba]> INSERT VERTEX team(name) VALUES \"200\":(\"Warriors\"), \"201\":(\"Nuggets\");\n",
    "        Execution succeeded (time spent 1.306ms/1.822751ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 02:54:54 UTC\n",
    "\n",
    "        # player の確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON player \"100\", \"101\", \"102\", \"103\" YIELD properties(vertex);\n",
    "        +--------------------------------------+\n",
    "        | properties(VERTEX)                   |\n",
    "        +--------------------------------------+\n",
    "        | {age: 42, name: \"Tim Duncan\"}        |\n",
    "        | {age: 33, name: \"LaMarcus Aldridge\"} |\n",
    "        | {age: 32, name: \"Rudy Gay\"}          |\n",
    "        | {age: 36, name: \"Tony Parker\"}       |\n",
    "        +--------------------------------------+\n",
    "        Got 4 rows (time spent 2.147ms/2.841892ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 02:56:12 UTC\n",
    "        \n",
    "        # team の確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON team \"200\", \"201\" YIELD properties(vertex)\n",
    "        +--------------------+\n",
    "        | properties(VERTEX) |\n",
    "        +--------------------+\n",
    "        | {name: \"Warriors\"} |\n",
    "        | {name: \"Nuggets\"}  |\n",
    "        +--------------------+\n",
    "        Got 2 rows (time spent 1.387ms/1.959948ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 02:58:47 UTC\n",
    "\n",
    "        # Multitagを複数のTAGに登録する\n",
    "        (root@nebula) [nba]> INSERT VERTEX test1(name), test2(age) VALUES \"199\":(\"Multitags\", 22)\n",
    "        Execution succeeded (time spent 3.797ms/4.281332ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:01:38 UTC\n",
    "\n",
    "        # test1の登録内容を確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON test1 \"199\" YIELD properties(vertex)\n",
    "        +---------------------+\n",
    "        | properties(VERTEX)  |\n",
    "        +---------------------+\n",
    "        | {name: \"Multitags\"} |\n",
    "        +---------------------+\n",
    "        Got 1 rows (time spent 991µs/1.580395ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:02:28 UTC\n",
    "\n",
    "        # test2の登録内容を確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON test2 \"199\" YIELD properties(vertex)\n",
    "        +--------------------+\n",
    "        | properties(VERTEX) |\n",
    "        +--------------------+\n",
    "        | {age: 22}          |\n",
    "        +--------------------+\n",
    "        Got 1 rows (time spent 1.255ms/1.794149ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:02:33 UTC\n",
    "        \n",
    "        # ID99の登録を確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON player \"99\" YIELD properties(vertex)\n",
    "        +---------------------------+\n",
    "        | properties(VERTEX)        |\n",
    "        +---------------------------+\n",
    "        | {age: 0, name: \"Useless\"} |\n",
    "        +---------------------------+\n",
    "        Got 1 rows (time spent 1.13ms/1.722841ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:04:52 UTC\n",
    "\n",
    "        # ID99を削除\n",
    "        (root@nebula) [nba]> DELETE VERTEX \"99\";\n",
    "        Execution succeeded (time spent 4.415ms/4.770656ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:05:09 UTC\n",
    "\n",
    "        # ID99が削除されていることを確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON player \"99\" YIELD properties(vertex)\n",
    "        +--------------------+\n",
    "        | properties(VERTEX) |\n",
    "        +--------------------+\n",
    "        +--------------------+\n",
    "        Empty set (time spent 1.02ms/1.557534ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:05:12 UTC\n",
    "        ```\n",
    "    \n",
    "    - EDGEの追加 => INSERT EDGE;\n",
    "    - EDGEの確認 => FETCH PROP ON;\n",
    "    \n",
    "        ```bash\n",
    "        # EDGEを追加\n",
    "        (root@nebula) [nba]> INSERT EDGE follow(degreee) VALUES \"100\"->\"101\":(95);\n",
    "        Execution succeeded (time spent 2.304ms/2.96339ms)\n",
    "\n",
    "        # EDGEを確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON follow \"100\"->\"101\" YIELD edge AS e;\n",
    "        +-----------------------------------------+\n",
    "        | e                                       |\n",
    "        +-----------------------------------------+\n",
    "        | [:follow \"100\"->\"101\" @0 {degreee: 95}] |\n",
    "        +-----------------------------------------+\n",
    "        Got 1 rows (time spent 12.304ms/12.948795ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:12:18 UTC\n",
    "        \n",
    "        # 複数のEDGEを一つのコマンドで追加\n",
    "        (root@nebula) [nba]> INSERT EDGE follow(degreee) VALUES \"100\"->\"102\":(90), \"102\"->\"101\":(75), \"100\"->\"103\":(70);\n",
    "        Execution succeeded (time spent 3.76ms/4.511298ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:15:38 UTC\n",
    "\n",
    "        # 複数のEDGEを一つのコマンドで追加\n",
    "        (root@nebula) [nba]> INSERT EDGE serve(start_year, end_year) VALUES \"100\"->\"200\":(1997, 2016), \"101\"->\"201\":(1999,2018);\n",
    "        Execution succeeded (time spent 3.332ms/3.989245ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:16:32 UTC\n",
    "\n",
    "        # EDGEが追加されていることを確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON follow \"100\"->\"101\", \"100\"->\"102\", \"102\"->\"101\" YIELD edge AS e;\n",
    "        +-----------------------------------------+\n",
    "        | e                                       |\n",
    "        +-----------------------------------------+\n",
    "        | [:follow \"100\"->\"101\" @0 {degreee: 95}] |\n",
    "        | [:follow \"100\"->\"102\" @0 {degreee: 90}] |\n",
    "        | [:follow \"102\"->\"101\" @0 {degreee: 75}] |\n",
    "        +-----------------------------------------+\n",
    "        Got 3 rows (time spent 2.507ms/3.507801ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:19:20 UTC\n",
    "\n",
    "        # EDGEが追加されていることを確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON serve \"100\"->\"200\", \"101\"->\"201\" YIELD edge AS e\n",
    "        +-------------------------------------------------------------+\n",
    "        | e                                                           |\n",
    "        +-------------------------------------------------------------+\n",
    "        | [:serve \"100\"->\"200\" @0 {end_year: 2016, start_year: 1997}] |\n",
    "        | [:serve \"101\"->\"201\" @0 {end_year: 2018, start_year: 1999}] |\n",
    "        +-------------------------------------------------------------+\n",
    "        Got 2 rows (time spent 1.586ms/2.237638ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 03:19:52 UTC\n",
    "\n",
    "        # Rankingを含めてEdgeを追加\n",
    "        (root@nebula) [nba]> INSERT EDGE follow(degreee) VALUES \"100\"->\"101\"@1:(80);\n",
    "        Execution succeeded (time spent 2.688ms/3.338571ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 04:09:35 UTC\n",
    "\n",
    "        # 追加したrankingを含むEDGEを確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON follow \"100\"->\"101\"@1 YIELD edge AS e;\n",
    "        +-----------------------------------------+\n",
    "        | e                                       |\n",
    "        +-----------------------------------------+\n",
    "        | [:follow \"100\"->\"101\" @1 {degreee: 80}] |\n",
    "        +-----------------------------------------+\n",
    "        Got 1 rows (time spent 1.567ms/2.079794ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 04:10:39 UTC\n",
    "\n",
    "        # EDGEを削除\n",
    "        (root@nebula) [nba]> DELETE EDGE follow \"100\"->\"103\";\n",
    "        Execution succeeded (time spent 3.867ms/4.340434ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 04:11:14 UTC\n",
    "\n",
    "        # EDGEが削除されたことを確認\n",
    "        (root@nebula) [nba]> FETCH PROP ON follow \"100\"->\"103\" YIELD edge AS e;\n",
    "        +---+\n",
    "        | e |\n",
    "        +---+\n",
    "        +---+\n",
    "        Empty set (time spent 1.139ms/1.732087ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 04:11:44 UTC\n",
    "        ```\n",
    "    \n",
    "    - クエリ => GO FROM;\n",
    "        \n",
    "        ```bash\n",
    "        (root@nebula) [nba]> GO FROM \"100\" OVER follow YIELD dst(edge);\n",
    "        +-----------+\n",
    "        | dst(EDGE) |\n",
    "        +-----------+\n",
    "        | \"101\"     |\n",
    "        | \"102\"     |\n",
    "        | \"101\"     |\n",
    "        +-----------+\n",
    "        Got 3 rows (time spent 2.264ms/2.890433ms)\n",
    "\n",
    "        Wed, 17 Jul 2024 04:28:04 UTC\n",
    "        ```\n",
    "\n",
    "\n",
    "- 次に調べること\n",
    "    - `vid_type` は何を表しているのか?\n",
    "    - `partition number` は何を表しているのか?\n",
    "        - Partitionとは何か？\n",
    "    - `Replica Factor`?\n",
    "        - Replicaとは何か？\n",
    "    - `ranking` とは何か？\n",
    "        `INSERT EDGE follow(degreee) VALUES \"100\"->\"101\"@1:(901)` の `@1` の部分\n",
    "    - 他のクエリの使い方は？"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Loggingの設定\n",
    "\n",
    "import logging\n",
    "import sys\n",
    "\n",
    "logging.basicConfig(stream=sys.stdout, level=logging.INFO)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "# OpenAIの作成\n",
    "\n",
    "from llama_index.llms.openai import OpenAI\n",
    "from llama_index.core import Settings\n",
    "\n",
    "Settings.llm = OpenAI(temperature=0, model=\"gpt-3.5-turbo\")\n",
    "Settings.chunk_size = 512"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Nebula Graphのコンフィグ\n",
    "\n",
    "import os\n",
    "\n",
    "os.environ[\"NEBULA_USER\"] = \"root\"\n",
    "os.environ[\"NEBULA_PASSWORD\"] = \"nebula\"  # default is \"nebula\"\n",
    "os.environ[\"NEBULA_ADDRESS\"] = (\n",
    "    \"127.0.0.1:9669\"  # assumed we have NebulaGraph installed locally\n",
    ")\n",
    "\n",
    "space_name = \"llamaindex\"\n",
    "edge_types, rel_prop_names = [\"relationship\"], [\n",
    "    \"relationship\"\n",
    "]  # default, could be omit if create from an empty kg\n",
    "tags = [\"entity\"]  # default, could be omit if create from an empty kg"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "# NebulaGraphの接続\n",
    "# 「llamaindexのスペースの作成手順」を実施後に実行する\n",
    "\n",
    "from llama_index.core import StorageContext\n",
    "from llama_index.graph_stores.nebula import NebulaGraphStore\n",
    "\n",
    "graph_store = NebulaGraphStore(\n",
    "    space_name=space_name,\n",
    "    edge_types=edge_types,\n",
    "    rel_prop_names=rel_prop_names,\n",
    "    tags=tags,\n",
    ")\n",
    "storage_context = StorageContext.from_defaults(graph_store=graph_store)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Knowledge Graphの構築手順\n",
    "\n",
    "1. `WikipediaReader` を使って情報を取得する\n",
    "1. `Document` に切り替える\n",
    "1. `KnowledgeGraphIndex` を生成する\n",
    "\n",
    "※ 構築に2分ぐらいかかる"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Documentのサンプル情報を取得する\n",
    "\n",
    "from llama_index.readers.wikipedia import WikipediaReader\n",
    "\n",
    "loader = WikipediaReader()\n",
    "documents = loader.load_data(\n",
    "    pages=[\"Guardians of the Galaxy Vol. 3\"], auto_suggest=False, lang_prefix=\"en\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/embeddings \"HTTP/1.1 200 OK\"\n"
     ]
    }
   ],
   "source": [
    "# KnowledgeGraphIndexを構築する\n",
    "\n",
    "from llama_index.core import KnowledgeGraphIndex\n",
    "\n",
    "kg_index = KnowledgeGraphIndex.from_documents(\n",
    "    documents,\n",
    "    storage_context=storage_context,\n",
    "    max_triplets_per_chunk=10,\n",
    "    # space_name=space_name,\n",
    "    # edge_types=edge_types,\n",
    "    # rel_prop_names=rel_prop_names,\n",
    "    # tags=tags,\n",
    "    include_embeddings=True,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[1;3;38;2;47;75;124mConnection Pool Created\u001b[0m\n",
      "INFO:nebula3.logger:Get connection to ('127.0.0.1', 9669)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>llamaindex</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         Name\n",
       "0  llamaindex"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Nebula Graphに接続してSpaceの情報を取得する\n",
    "%load_ext ngql\n",
    "%ngql --address 127.0.0.1 --port 9669 --user root --password root"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:nebula3.logger:Get connection to ('127.0.0.1', 9669)\n",
      "INFO:nebula3.logger:Get connection to ('127.0.0.1', 9669)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>e</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"Adam\")-[:relationship@9005598024634048093{relationship: \"Stabbed by\"}]-&gt;(\"Nebula\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"Adam mckay\")-[:relationship@-7875718538987686817{relationship: \"Said he was willing to work with\"}]-&gt;(\"Marvel studios again\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>(\"Adam warlock\")-[:relationship@-7355033301802044942{relationship: \"Created by\"}]-&gt;(\"High priestess ayesha\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>(\"Adam warlock\")-[:relationship@-6025549415605064876{relationship: \"Importance on\"}]-&gt;(\"Cosmic side\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>(\"Adam warlock\")-[:relationship@4003220439395659920{relationship: \"Created by\"}]-&gt;(\"High priestess ayesha\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>(\"Adam warlock\")-[:relationship@7673960981714070136{relationship: \"Noted\"}]-&gt;(\"Importance\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>(\"Alan f. horn\")-[:relationship@2023067982055303897{relationship: \"Stated\"}]-&gt;(\"Offensive attitudes\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>(\"Alan f. horn\")-[:relationship@7888911368531140309{relationship: \"Stated\"}]-&gt;(\"Offensive attitudes\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>(\"Allmovie\")-[:relationship@-9163102535676806896{relationship: \"At\"}]-&gt;(\"Guardians of the galaxy vol. 3\")</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>(\"Allmovie\")-[:relationship@2569255774608074042{relationship: \"At\"}]-&gt;(\"Guardians of the galaxy vol. 3\")</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                                                                 e\n",
       "0                                             (\"Adam\")-[:relationship@9005598024634048093{relationship: \"Stabbed by\"}]->(\"Nebula\")\n",
       "1  (\"Adam mckay\")-[:relationship@-7875718538987686817{relationship: \"Said he was willing to work with\"}]->(\"Marvel studios again\")\n",
       "2                     (\"Adam warlock\")-[:relationship@-7355033301802044942{relationship: \"Created by\"}]->(\"High priestess ayesha\")\n",
       "3                            (\"Adam warlock\")-[:relationship@-6025549415605064876{relationship: \"Importance on\"}]->(\"Cosmic side\")\n",
       "4                      (\"Adam warlock\")-[:relationship@4003220439395659920{relationship: \"Created by\"}]->(\"High priestess ayesha\")\n",
       "5                                      (\"Adam warlock\")-[:relationship@7673960981714070136{relationship: \"Noted\"}]->(\"Importance\")\n",
       "6                            (\"Alan f. horn\")-[:relationship@2023067982055303897{relationship: \"Stated\"}]->(\"Offensive attitudes\")\n",
       "7                            (\"Alan f. horn\")-[:relationship@7888911368531140309{relationship: \"Stated\"}]->(\"Offensive attitudes\")\n",
       "8                        (\"Allmovie\")-[:relationship@-9163102535676806896{relationship: \"At\"}]->(\"Guardians of the galaxy vol. 3\")\n",
       "9                         (\"Allmovie\")-[:relationship@2569255774608074042{relationship: \"At\"}]->(\"Guardians of the galaxy vol. 3\")"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# llamaindexの検索を行う\n",
    "\n",
    "%ngql USE llamaindex;\n",
    "%ngql MATCH ()-[e]->() RETURN e LIMIT 10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_cell_9.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7ff088a59790>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "<class 'pyvis.network.Network'> |N|=12 |E|=10"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# draw the result\n",
    "# 結果が出力されない\n",
    "%ng_draw"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## サンプルコードでは以下のエラーが発生\n",
    "\n",
    "```bash\n",
    "ValidationError: 1 validation error for LLMPredictStartEvent\n",
    "template\n",
    "  none is not an allowed value (type=type_error.none.not_allowed)\n",
    "```\n",
    "\n",
    "- [issue#13741](https://github.com/run-llama/llama_index/issues/13741)より、promptを定義することで回避できる\n",
    "\n",
    "## 上記対策を行っても以下のエラーが発生する\n",
    "   \n",
    "``` bash\n",
    "ValueError: Query failed. Query: Question: What are the top 5 most influential nodes in the knowledge graph based on their number of relationships?\n",
    "\n",
    "Cypher Query:\n",
    "\n",
    "MATCH (n)\n",
    "RETURN n, size((n)--()) AS relationships\n",
    "ORDER BY relationships DESC\n",
    "LIMIT 5, Param: {}Error message: SyntaxError: syntax error near `Question'\n",
    "\n",
    "The above exception was the direct cause of the following exception:\n",
    "\n",
    "RetryError                                Traceback (most recent call last)\n",
    "RetryError: RetryError[<Future at 0x7ff08493c890 state=finished raised ValueError>]\"\n",
    "```\n",
    "   \n",
    "## 作成するPromptをNebula Graph用にLLMに書き換えてもらったがダメ\n",
    "   \n",
    "```bash\n",
    "{\n",
    "ValueError: Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
    "RETURN friend.name, Param: {}Error message: SemanticError: `Person': Unknown tag\n",
    "\n",
    "The above exception was the direct cause of the following exception:\n",
    "\n",
    "RetryError: RetryError[<Future at 0x7ff084431f10 state=finished raised ValueError>]\"\n",
    "}\n",
    "```\n",
    "\n",
    "なんとなくQueryの生成で失敗していそうな気がする"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# KnowledgeGraphのPromptsの作成\n",
    "from llama_index.core.prompts.base import PromptTemplate, PromptType\n",
    "\n",
    "graph_query_synthesis_prompt = PromptTemplate(\n",
    "    (\n",
    "        \"You are a Graph database expert. You are given a question that requires information retrieval from a Nebula Graph. \\n\"\n",
    "        \"Generate a precise query that retrieves the relevant information needed to answer the question.\"\n",
    "    ),\n",
    "    prompt_type=PromptType.QUESTION_ANSWER,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_439455/1732950042.py:4: DeprecationWarning: Call to deprecated class KnowledgeGraphQueryEngine. (KnowledgeGraphQueryEngine is deprecated. It is recommended to use the PropertyGraphIndex and associated retrievers instead.) -- Deprecated since version 0.10.53.\n",
      "  query_engine = KnowledgeGraphQueryEngine(\n"
     ]
    }
   ],
   "source": [
    "# KnowledgeGraphQueryEngineの作成\n",
    "from llama_index.core.query_engine import KnowledgeGraphQueryEngine\n",
    "\n",
    "query_engine = KnowledgeGraphQueryEngine(\n",
    "    storage_context=storage_context,\n",
    "    graph_query_synthesis_prompt=graph_query_synthesis_prompt,\n",
    "    verbose=True,\n",
    ")\n",
    "\n",
    "print(query_engine._re)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "\u001b[1;3;33mGraph Store Query:\n",
      "MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
      "RETURN friend.name\n",
      "\u001b[0mERROR:llama_index.graph_stores.nebula.nebula_graph_store:Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
      "RETURN friend.name, Param: {}Error message: Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
      "RETURN friend.name, Param: {}Error message: SemanticError: `Person': Unknown tag\n",
      "ERROR:llama_index.graph_stores.nebula.nebula_graph_store:Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
      "RETURN friend.name, Param: {}Error message: Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
      "RETURN friend.name, Param: {}Error message: SemanticError: `Person': Unknown tag\n",
      "ERROR:llama_index.graph_stores.nebula.nebula_graph_store:Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
      "RETURN friend.name, Param: {}Error message: Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\n",
      "RETURN friend.name, Param: {}Error message: SemanticError: `Person': Unknown tag\n"
     ]
    },
    {
     "ename": "RetryError",
     "evalue": "RetryError[<Future at 0x7ff084431f10 state=finished raised ValueError>]",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/tenacity/__init__.py:478\u001b[0m, in \u001b[0;36mRetrying.__call__\u001b[0;34m(self, fn, *args, **kwargs)\u001b[0m\n\u001b[1;32m    477\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 478\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[43mfn\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    479\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m:  \u001b[38;5;66;03m# noqa: B902\u001b[39;00m\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/llama_index/graph_stores/nebula/nebula_graph_store.py:266\u001b[0m, in \u001b[0;36mNebulaGraphStore.execute\u001b[0;34m(self, query, param_map)\u001b[0m\n\u001b[1;32m    265\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m result\u001b[38;5;241m.\u001b[39mis_succeeded():\n\u001b[0;32m--> 266\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\n\u001b[1;32m    267\u001b[0m         \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mQuery failed. Query: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mquery\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m, Param: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mparam_map\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m    268\u001b[0m         \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mError message: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mresult\u001b[38;5;241m.\u001b[39merror_msg()\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m    269\u001b[0m     )\n\u001b[1;32m    270\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m result\n",
      "\u001b[0;31mValueError\u001b[0m: Query failed. Query: MATCH (p:Person {name: 'John Doe'})-[:FRIENDS_WITH]->(friend)\nRETURN friend.name, Param: {}Error message: SemanticError: `Person': Unknown tag",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[0;31mRetryError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[18], line 3\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[38;5;66;03m# 質問の実施\u001b[39;00m\n\u001b[0;32m----> 3\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[43mquery_engine\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m      4\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mTell me about Peter Quill?\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[1;32m      5\u001b[0m \u001b[43m)\u001b[49m\n\u001b[1;32m      6\u001b[0m display(Markdown(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mresponse\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m))\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/llama_index/core/instrumentation/dispatcher.py:230\u001b[0m, in \u001b[0;36mDispatcher.span.<locals>.wrapper\u001b[0;34m(func, instance, args, kwargs)\u001b[0m\n\u001b[1;32m    226\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mspan_enter(\n\u001b[1;32m    227\u001b[0m     id_\u001b[38;5;241m=\u001b[39mid_, bound_args\u001b[38;5;241m=\u001b[39mbound_args, instance\u001b[38;5;241m=\u001b[39minstance, parent_id\u001b[38;5;241m=\u001b[39mparent_id\n\u001b[1;32m    228\u001b[0m )\n\u001b[1;32m    229\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 230\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    231\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    232\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mevent(SpanDropEvent(span_id\u001b[38;5;241m=\u001b[39mid_, err_str\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mstr\u001b[39m(e)))\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/llama_index/core/base/base_query_engine.py:52\u001b[0m, in \u001b[0;36mBaseQueryEngine.query\u001b[0;34m(self, str_or_query_bundle)\u001b[0m\n\u001b[1;32m     50\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(str_or_query_bundle, \u001b[38;5;28mstr\u001b[39m):\n\u001b[1;32m     51\u001b[0m         str_or_query_bundle \u001b[38;5;241m=\u001b[39m QueryBundle(str_or_query_bundle)\n\u001b[0;32m---> 52\u001b[0m     query_result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mstr_or_query_bundle\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m     53\u001b[0m dispatcher\u001b[38;5;241m.\u001b[39mevent(\n\u001b[1;32m     54\u001b[0m     QueryEndEvent(query\u001b[38;5;241m=\u001b[39mstr_or_query_bundle, response\u001b[38;5;241m=\u001b[39mquery_result)\n\u001b[1;32m     55\u001b[0m )\n\u001b[1;32m     56\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m query_result\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/llama_index/core/instrumentation/dispatcher.py:230\u001b[0m, in \u001b[0;36mDispatcher.span.<locals>.wrapper\u001b[0;34m(func, instance, args, kwargs)\u001b[0m\n\u001b[1;32m    226\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mspan_enter(\n\u001b[1;32m    227\u001b[0m     id_\u001b[38;5;241m=\u001b[39mid_, bound_args\u001b[38;5;241m=\u001b[39mbound_args, instance\u001b[38;5;241m=\u001b[39minstance, parent_id\u001b[38;5;241m=\u001b[39mparent_id\n\u001b[1;32m    228\u001b[0m )\n\u001b[1;32m    229\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 230\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    231\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    232\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mevent(SpanDropEvent(span_id\u001b[38;5;241m=\u001b[39mid_, err_str\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mstr\u001b[39m(e)))\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/llama_index/core/query_engine/knowledge_graph_query_engine.py:207\u001b[0m, in \u001b[0;36mKnowledgeGraphQueryEngine._query\u001b[0;34m(self, query_bundle)\u001b[0m\n\u001b[1;32m    203\u001b[0m \u001b[38;5;250m\u001b[39m\u001b[38;5;124;03m\"\"\"Query the graph store.\"\"\"\u001b[39;00m\n\u001b[1;32m    204\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mevent(\n\u001b[1;32m    205\u001b[0m     CBEventType\u001b[38;5;241m.\u001b[39mQUERY, payload\u001b[38;5;241m=\u001b[39m{EventPayload\u001b[38;5;241m.\u001b[39mQUERY_STR: query_bundle\u001b[38;5;241m.\u001b[39mquery_str}\n\u001b[1;32m    206\u001b[0m ) \u001b[38;5;28;01mas\u001b[39;00m query_event:\n\u001b[0;32m--> 207\u001b[0m     nodes: List[NodeWithScore] \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_retrieve\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery_bundle\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    209\u001b[0m     response \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_response_synthesizer\u001b[38;5;241m.\u001b[39msynthesize(\n\u001b[1;32m    210\u001b[0m         query\u001b[38;5;241m=\u001b[39mquery_bundle,\n\u001b[1;32m    211\u001b[0m         nodes\u001b[38;5;241m=\u001b[39mnodes,\n\u001b[1;32m    212\u001b[0m     )\n\u001b[1;32m    214\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_verbose:\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/llama_index/core/query_engine/knowledge_graph_query_engine.py:172\u001b[0m, in \u001b[0;36mKnowledgeGraphQueryEngine._retrieve\u001b[0;34m(self, query_bundle)\u001b[0m\n\u001b[1;32m    165\u001b[0m logger\u001b[38;5;241m.\u001b[39mdebug(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mGraph Store Query:\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;132;01m{\u001b[39;00mgraph_store_query\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m    167\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mevent(\n\u001b[1;32m    168\u001b[0m     CBEventType\u001b[38;5;241m.\u001b[39mRETRIEVE,\n\u001b[1;32m    169\u001b[0m     payload\u001b[38;5;241m=\u001b[39m{EventPayload\u001b[38;5;241m.\u001b[39mQUERY_STR: graph_store_query},\n\u001b[1;32m    170\u001b[0m ) \u001b[38;5;28;01mas\u001b[39;00m retrieve_event:\n\u001b[1;32m    171\u001b[0m     \u001b[38;5;66;03m# Get the graph store response\u001b[39;00m\n\u001b[0;32m--> 172\u001b[0m     graph_store_response \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mgraph_store\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mgraph_store_query\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    173\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_verbose:\n\u001b[1;32m    174\u001b[0m         print_text(\n\u001b[1;32m    175\u001b[0m             \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mGraph Store Response:\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;132;01m{\u001b[39;00mgraph_store_response\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m    176\u001b[0m             color\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124myellow\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m    177\u001b[0m         )\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/llama_index/graph_stores/nebula/nebula_graph_store.py:660\u001b[0m, in \u001b[0;36mNebulaGraphStore.query\u001b[0;34m(self, query, param_map)\u001b[0m\n\u001b[1;32m    659\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mquery\u001b[39m(\u001b[38;5;28mself\u001b[39m, query: \u001b[38;5;28mstr\u001b[39m, param_map: Optional[Dict[\u001b[38;5;28mstr\u001b[39m, Any]] \u001b[38;5;241m=\u001b[39m {}) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m Any:\n\u001b[0;32m--> 660\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mexecute\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparam_map\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    661\u001b[0m     columns \u001b[38;5;241m=\u001b[39m result\u001b[38;5;241m.\u001b[39mkeys()\n\u001b[1;32m    662\u001b[0m     d: Dict[\u001b[38;5;28mstr\u001b[39m, \u001b[38;5;28mlist\u001b[39m] \u001b[38;5;241m=\u001b[39m {}\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/tenacity/__init__.py:336\u001b[0m, in \u001b[0;36mBaseRetrying.wraps.<locals>.wrapped_f\u001b[0;34m(*args, **kw)\u001b[0m\n\u001b[1;32m    334\u001b[0m copy \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcopy()\n\u001b[1;32m    335\u001b[0m wrapped_f\u001b[38;5;241m.\u001b[39mstatistics \u001b[38;5;241m=\u001b[39m copy\u001b[38;5;241m.\u001b[39mstatistics  \u001b[38;5;66;03m# type: ignore[attr-defined]\u001b[39;00m\n\u001b[0;32m--> 336\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mcopy\u001b[49m\u001b[43m(\u001b[49m\u001b[43mf\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkw\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/tenacity/__init__.py:475\u001b[0m, in \u001b[0;36mRetrying.__call__\u001b[0;34m(self, fn, *args, **kwargs)\u001b[0m\n\u001b[1;32m    473\u001b[0m retry_state \u001b[38;5;241m=\u001b[39m RetryCallState(retry_object\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m, fn\u001b[38;5;241m=\u001b[39mfn, args\u001b[38;5;241m=\u001b[39margs, kwargs\u001b[38;5;241m=\u001b[39mkwargs)\n\u001b[1;32m    474\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28;01mTrue\u001b[39;00m:\n\u001b[0;32m--> 475\u001b[0m     do \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43miter\u001b[49m\u001b[43m(\u001b[49m\u001b[43mretry_state\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mretry_state\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    476\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(do, DoAttempt):\n\u001b[1;32m    477\u001b[0m         \u001b[38;5;28;01mtry\u001b[39;00m:\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/tenacity/__init__.py:376\u001b[0m, in \u001b[0;36mBaseRetrying.iter\u001b[0;34m(self, retry_state)\u001b[0m\n\u001b[1;32m    374\u001b[0m result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[1;32m    375\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m action \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39miter_state\u001b[38;5;241m.\u001b[39mactions:\n\u001b[0;32m--> 376\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[43maction\u001b[49m\u001b[43m(\u001b[49m\u001b[43mretry_state\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    377\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m result\n",
      "File \u001b[0;32m~/repositories/survey-knowledge-graph/.venv/lib/python3.11/site-packages/tenacity/__init__.py:419\u001b[0m, in \u001b[0;36mBaseRetrying._post_stop_check_actions.<locals>.exc_check\u001b[0;34m(rs)\u001b[0m\n\u001b[1;32m    417\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mreraise:\n\u001b[1;32m    418\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m retry_exc\u001b[38;5;241m.\u001b[39mreraise()\n\u001b[0;32m--> 419\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m retry_exc \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01mfut\u001b[39;00m\u001b[38;5;21;01m.\u001b[39;00m\u001b[38;5;21;01mexception\u001b[39;00m()\n",
      "\u001b[0;31mRetryError\u001b[0m: RetryError[<Future at 0x7ff084431f10 state=finished raised ValueError>]"
     ]
    }
   ],
   "source": [
    "# 質問の実施\n",
    "\n",
    "response = query_engine.query(\n",
    "    \"Tell me about Peter Quill?\",\n",
    ")\n",
    "display(Markdown(f\"{response}\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:httpx:HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n"
     ]
    },
    {
     "data": {
      "text/markdown": [
       "\n",
       "```cypher\n",
       "Sure, I'd be happy to help! To generate a precise query for Nebula Graph, I need to know the specific question you are trying to answer and the schema of your graph database (i.e., the vertices, edges, and their properties). Could you please provide more details on the question and the structure of your graph?\n",
       "```\n"
      ],
      "text/plain": [
       "<IPython.core.display.Markdown object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from IPython.display import display, Markdown\n",
    "\n",
    "graph_query = query_engine.generate_query(\n",
    "    \"Tell me about Peter Quill?\",\n",
    ")\n",
    "\n",
    "graph_query = graph_query.replace(\"WHERE\", \"\\n  WHERE\").replace(\"RETURN\", \"\\nRETURN\")\n",
    "\n",
    "display(\n",
    "    Markdown(\n",
    "        f\"\"\"\n",
    "```cypher\n",
    "{graph_query}\n",
    "```\n",
    "\"\"\"\n",
    "    )\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:nebula3.logger:Get connection to ('127.0.0.1', 9669)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.entity.name</th>\n",
       "      <th>e.relationship</th>\n",
       "      <th>m.entity.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [p.entity.name, e.relationship, m.entity.name]\n",
       "Index: []"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH (p:`entity`)-[e:relationship]->(m:`entity`)\n",
    "  WHERE p.`entity`.`name` == 'Peter Quill'\n",
    "RETURN p.`entity`.`name`, e.relationship, m.`entity`.`name`;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:nebula3.logger:Get connection to ('127.0.0.1', 9669)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>e</th>\n",
       "      <th>m</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [p, e, m]\n",
       "Index: []"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH (p:`entity`)-[e:relationship]->(m:`entity`)\n",
    "  WHERE p.`entity`.`name` == 'Peter Quill'\n",
    "RETURN p, e, m;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_cell_46.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7ff0889ae3d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "<class 'pyvis.network.Network'> |N|=0 |E|=0"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
